{
    "tituloCurso": "Introdução ao <svg width=\"2500\" height=\"708\" viewBox=\"0 0 512 145\" xmlns=\"http://www.w3.org/2000/svg\" preserveAspectRatio=\"xMinYMin meet\"><g fill=\"#83CD29\"><path d=\"M471.05 51.611c-1.244 0-2.454.257-3.525.863l-33.888 19.57c-2.193 1.264-3.526 3.65-3.526 6.189v39.069c0 2.537 1.333 4.92 3.526 6.187l8.85 5.109c4.3 2.119 5.885 2.086 7.842 2.086 6.366 0 10.001-3.863 10.001-10.576V81.542c0-.545-.472-.935-1.007-.935h-4.245c-.544 0-1.007.39-1.007.935v38.566c0 2.975-3.1 5.968-8.13 3.453l-9.21-5.396c-.326-.177-.576-.49-.576-.863v-39.07c0-.37.247-.747.576-.935L470.547 57.8a.998.998 0 0 1 1.007 0l33.817 19.498c.322.194.576.553.576.936v39.069c0 .373-.188.755-.504.935l-33.889 19.498c-.29.173-.69.173-1.007 0l-8.706-5.18a.905.905 0 0 0-.863 0c-2.403 1.362-2.855 1.52-5.109 2.302-.555.194-1.398.495.288 1.44l11.368 6.69a6.995 6.995 0 0 0 3.526.936 6.949 6.949 0 0 0 3.525-.935l33.889-19.499c2.193-1.275 3.525-3.65 3.525-6.187v-39.07c0-2.538-1.332-4.92-3.525-6.187l-33.889-19.57c-1.062-.607-2.28-.864-3.525-.864z\" /><path d=\"M480.116 79.528c-9.65 0-15.397 4.107-15.397 10.937 0 7.408 5.704 9.444 14.966 10.36 11.08 1.085 11.943 2.712 11.943 4.893 0 3.783-3.016 5.396-10.144 5.396-8.957 0-10.925-2.236-11.584-6.691-.078-.478-.447-.864-.936-.864h-4.389c-.54 0-1.007.466-1.007 1.008 0 5.703 3.102 12.447 17.916 12.447 10.723 0 16.908-4.209 16.908-11.584 0-7.31-4.996-9.273-15.398-10.648-10.51-1.391-11.512-2.072-11.512-4.533 0-2.032.85-4.75 8.634-4.75 6.954 0 9.524 1.5 10.577 6.189.092.44.48.791.935.791h4.39c.27 0 .532-.166.719-.36.184-.207.314-.44.288-.719-.68-8.074-6.064-11.872-16.909-11.872z\" /></g><path d=\"M271.821.383a2.181 2.181 0 0 0-1.08.287 2.18 2.18 0 0 0-1.079 1.871v55.042c0 .54-.251 1.024-.719 1.295a1.501 1.501 0 0 1-1.511 0l-8.994-5.18a4.31 4.31 0 0 0-4.317 0l-35.903 20.721c-1.342.775-2.158 2.264-2.158 3.814v41.443c0 1.548.817 2.966 2.158 3.741l35.903 20.722a4.3 4.3 0 0 0 4.317 0l35.903-20.722a4.308 4.308 0 0 0 2.159-3.741V16.356a4.386 4.386 0 0 0-2.23-3.814L272.9.598c-.335-.187-.707-.22-1.079-.215zM40.861 52.115c-.684.027-1.328.147-1.942.503L3.015 73.34a4.3 4.3 0 0 0-2.158 3.741L.929 132.7c0 .773.399 1.492 1.079 1.87a2.096 2.096 0 0 0 2.159 0l21.297-12.231c1.349-.802 2.23-2.196 2.23-3.742V92.623c0-1.55.815-2.972 2.159-3.742l9.065-5.252a4.251 4.251 0 0 1 2.159-.576c.74 0 1.5.185 2.158.576l9.066 5.252a4.296 4.296 0 0 1 2.159 3.742v25.973c0 1.546.89 2.95 2.23 3.742l21.297 12.232a2.096 2.096 0 0 0 2.159 0 2.164 2.164 0 0 0 1.08-1.871l.07-55.618a4.28 4.28 0 0 0-2.158-3.741L43.235 52.618c-.607-.356-1.253-.475-1.942-.503h-.432zm322.624.503c-.75 0-1.485.19-2.158.576l-35.903 20.722a4.306 4.306 0 0 0-2.159 3.741V119.1c0 1.559.878 2.971 2.23 3.742l35.616 20.29c1.315.75 2.921.807 4.245.07l21.585-12.015c.685-.38 1.148-1.09 1.151-1.87a2.126 2.126 0 0 0-1.079-1.871l-36.119-20.722c-.676-.386-1.151-1.167-1.151-1.943v-12.95c0-.775.48-1.485 1.151-1.871l11.224-6.476a2.155 2.155 0 0 1 2.159 0L375.5 89.96a2.152 2.152 0 0 1 1.08 1.87v10.217a2.15 2.15 0 0 0 1.079 1.87c.673.389 1.487.39 2.158 0L401.331 91.4a4.325 4.325 0 0 0 2.159-3.742v-10c0-1.545-.82-2.966-2.159-3.742l-35.687-20.722a4.279 4.279 0 0 0-2.159-.575zm-107.35 30.939c.188 0 .408.046.576.143l12.304 7.123c.334.193.576.55.576.935v14.246c0 .387-.24.743-.576.936l-12.304 7.123a1.088 1.088 0 0 1-1.079 0l-12.303-7.123c-.335-.194-.576-.549-.576-.936V91.758c0-.386.242-.74.576-.935l12.303-7.122a.948.948 0 0 1 .504-.143v-.001z\" fill=\"#404137\" /><path d=\"M148.714 52.402c-.748 0-1.488.19-2.158.576l-35.903 20.65c-1.343.773-2.159 2.265-2.159 3.813v41.443c0 1.55.817 2.966 2.159 3.742l35.903 20.721a4.297 4.297 0 0 0 4.317 0l35.903-20.721a4.308 4.308 0 0 0 2.158-3.742V77.441c0-1.55-.816-3.04-2.158-3.813l-35.903-20.65a4.297 4.297 0 0 0-2.159-.576zM363.413 89.385c-.143 0-.302 0-.431.072l-6.907 4.029a.84.84 0 0 0-.432.72v7.914c0 .298.172.571.432.72l6.907 3.957c.259.15.535.15.791 0l6.907-3.958a.846.846 0 0 0 .432-.719v-7.915a.846.846 0 0 0-.432-.719l-6.907-4.03c-.128-.075-.216-.07-.36-.07z\" fill=\"#83CD29\" /></svg>, o front-end que virou back-end",
    "descricao": "Neste curso, você aprenderá o tudo o que precisa para começar a programar em Node.js e tirar suas ideias do papel, com uma didática simples, prática e eficiente!",
    "modulos": [
        {
            "titulo": "🚀 Introdução ao Node.Js",
            "descricao": "Entenda o que é o Node.js, por que ele é tão utilizado e como instalá-lo corretamente. Configure o npm e execute seu primeiro script no ambiente Node.js.",
            "pathImgModulo": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
            "categoria": "introdução",
            "duracao": "1h",
            "colors": {
                "main": "#3784D1",
                "background": "#C4DBF2"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "O que é Node.js?",
                        "descricao": "Descubra o que é o Node.js, suas principais características e por que ele é amplamente utilizado no desenvolvimento backend.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "Node.js é um ambiente de execução JavaScript que permite executar código JavaScript no lado do servidor, proporcionando uma alternativa altamente eficaz para a construção de servidores de aplicação. Criado por Ryan Dahl e lançado em maio de 2009, Node.js utiliza o motor V8 JavaScript da Google e introduz um modelo de programação baseado em um loop de eventos assíncrono, que permite a execução de operações de entrada e saída sem bloqueios.",
                                "pathImgInferior": "/assets/Exemplo/resumo Ryan Dahl.jpg",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Ryan Dahl desenvolveu Node.js inspirado pelo processo de carregamento de arquivos no Flickr e observando que servidores como o Apache gerenciavam conexões de forma ineficaz. Dahl percebeu a necessidade de um ambiente capaz de gerenciar milhares de conexões simultâneas sem se tornar bloqueante, e assim nasceu o Node.js.<br/><br/>&#9• Motor V8 da Google: Node.js utiliza o motor V8, que é conhecido por sua alta performance na execução de código JavaScript.<br/>&nbsp;&nbsp;&nbsp;&nbsp;• Loop de Eventos Assíncrono: A principal inovação de Node.js é seu loop de eventos assíncrono, permitindo que operações de entrada e saída sejam executadas sem bloqueios.<br/>&#9• Gerenciamento Eficiente de Conexões: Node.js é capaz de lidar com milhares de conexões simultâneas de maneira eficiente, tornando-o ideal para aplicações em tempo real.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "A popularidade de Node.js cresceu rapidamente após seu lançamento, especialmente devido à sua capacidade de lidar com conexões simultâneas e ao fato de que os desenvolvedores já estavam familiarizados com JavaScript, a linguagem predominante no desenvolvimento web. Node.js é amplamente utilizado para criar aplicações de alta performance, como servidores web, APIs e serviços de streaming. Node.js revolucionou o desenvolvimento de aplicações web, oferecendo uma solução poderosa e eficiente para o lado do servidor, e continua a ser uma escolha popular entre desenvolvedores por suas características inovadoras e desempenho robusto.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Os paradigmais do Node.js",
                        "descricao": "Aqui veremos os paradigmas do Node.js, incluindo a programação assíncrona e orientada a eventos e objetos, a programação funcional e a modularização. Esses conceitos são essenciais para criar aplicações escaláveis e eficientes.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://youtu.be/ET59Wd4gP2E",
                        "highlightColor": "#1265E2",
                        "paragrafos": [
                            {
                                "texto": "Um paradigma de programação é uma abordagem ou estilo fundamental que orienta a forma como soluções são desenvolvidas em linguagens de programação. Ele define a estrutura e os elementos que compõem um programa, bem como as interações entre eles. Os principais paradigmas incluem:<br/><ol>&#9<li><b>Paradigma Imperativo:</b> Baseia-se na descrição de uma sequência de instruções que alteram o estado do programa até alcançar o resultado desejado, focando em descrever &quot;como&quot; um programa deve realizar tarefas através de sequências de comandos que alteram o estado do sistema. Linguagens como C e Pascal seguem esse paradigma.<br/><br/><b>Características:</b><br/>O paradigma Imperativo possui algumas características que podem ser definidas como sendo: <br/>&#9• A <b>ênfase em &quot;como&quot; realizar as operações</b>;<br/>&#9• O <b>uso de variáveis que armazenam o estado do programa</b>;<br/>&#9• O <b>controle explicito do fluxo de execução através de estruturas como loops e condicionais.</b><br/><br/>Abaixo temos um exemplo em que o código instrui explicitamente o computador a somar os números de 1 a 5, atualizando o valor de <code>let contador</code></i></b> a cada iteração.</li></ol>",
                                "pathImgInferior": "/assets/Exemplo/exemplo paradigma imperativo.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<ol start='2'><li><b>Paradigma Procedural:</b> É como se fosse uma extensão do paradigma imperativo que organiza o código em procedimentos ou funções, isso permite que o código se torne mais reutilizável e mais modular, melhorando o processo de desenvolvimento, escrita e leitura e facilitando a manutenção do código posteriormente.</li></ol>",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<b>Características:</b><br/>Para este paradigma temos as seguintes características:<br/>&#9• <b>Divisão do programa em sub-rotinas ou funções</b>;<br/>&#9• <b>Melhoria da manutenção e leitura do código</b>;<br/>&#9• <b>A otimização do fluxo de trabalho.</b>",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Abaixo, temos um exemplo que mostra como isso funciona, temos uma função <code>somar</code></i></b> que encapsula a operação de adição, possibilitando a reutilização da função infinitas vezes no código, função essa que irá retornar o resultado da soma dos parâmetros <code>a</code></i></b> e <code>b</code></i></b>, isso é extremamente positivo pois já retorna o número diretamente no final, por isso que ao usarmos o <code>console.log(resultado)</code></i></b> a saída que o código nos retornará é o próprio número",
                                "pathImgInferior": "/assets/Exemplo/exemplo paradigma procedural.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<ol start='3'>&#9<li><b>Programação Orientada a Objetos (POO): </b> Organiza o código em torno de &quot;objetos&quot; que encapsulam dados e comportamentos. Linguagens como Java, C++ e Python adotam esse paradigma. A utilização do paradigma da Programação Orientada a Objetos (POO) no Node.js melhora a organização, reutilização e segurança do código, tornando-o mais modular, escalável e fácil de manter. Com conceitos como herança, encapsulamento e polimorfismo, a POO permite criar sistemas mais estruturados e flexíveis.</li></ol>",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<b>Características:</b><br/>Podemos destacar as seguintes características do POO no Node.js:<br/>&#9• <b>Encapsulamento:</b> proteção dos dados internos do objeto;<br/>&#9• <b>Herança:</b> capacidade de criar classes baseadas (herdadas) em classes existentes;<br/>&#9• <b>Polimorfismo:</b> permite que diferentes objetos respondam de maneira específica a uma mesma mensagem ou método.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Abaixo temos um exemplo dessa vez sobre o POO sendo aplicado no Node.js, aqui, temos a classe <code>Animal</code></i></b> que tem suas características genéricas e seu construtor, o construtor em POO, é um método &quot;padrão&quot; necessário para que as propriedades (parâmetros) do objeto sejam inicializadas, imagine aqui as características gerais de todo(ou do grupo que esteja definindo) animal faz, neste caso, estamos considerando que todo animal faz um som, portanto, definimos aqui o método <code>emitirSom()</code></i></b>, que indica ao usuário que o animal esta fazendo um som. Mais abaixo, na linha 9, temos outra classe que está &quot;estendendo&quot; da classe genérica <code>Animal</code></i></b>, isso indica que a classe que foi estendida, herdará todas as características genéricas definidas na classe <code>Animal</code></i></b>, nesse caso, criamos a classe Cachorro, que estende (herdando suas características) da classe <code>Animal</code></i></b>, mas, sabemos que o cachorro late, então, realizamos um o que chamamos de overriding, estamos sobrescrevendo o método original <code>emitirSom()</code></i></b>, para especificar que, para este animal no caso o cachorro, quando chamarmos o método <code>emitirSom()</code></i></b>, possamos retornar que o cachorro esta latindo. Nas linhas 14 e 15 estamos criando o que chamamos de Instâncias das classes criadas, podemos criar quantas instâncias quisermos, e atribuir a elas os parâmetros definidos no construtor, nesse caso o nome do animal, e, por fim, nas linhas 16 e 17 estamos &quot;invocando&quot;, o método <code>emitirSom()</code></i></b> definido nas classes, no caso estamos falando &quot;animal x emita um som&quot;, e o código irá nos retornar o que pedimos:",
                                "pathImgInferior": "/assets/Exemplo/exemplo paradigma POO.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<ol start='4'>&#9<li><b>Programação Funcional:</b> A programação funcional é um paradigma que trata a computação como a avaliação de funções matemáticas, evitando mudanças de estado e dados mutáveis. Diferentemente da programação imperativa, que se baseia em comandos sequenciais que alteram o estado do programa, a programação funcional descreve o que deve ser alcançado por meio de funções.</li></ol>",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<b>Características:</b><br/>Este paradigma aplicado no Node.js a programação funcional pode ser empregada das seguintes maneiras:<br/>&#9• <b>Uso de Funções de Alta Ordem:</b> Funções como <code>map</code>, <code>filter</code> e <code>reduce</code> permitem manipular coleções de dados de forma declarativa, promovendo um código mais conciso e legível;<br/>&#9• <b>Imutabilidade:</b> Embora o JavaScript não imponha imutabilidade por padrão, é possível utilizar bibliotecas como Immutable.js para garantir que os dados não sejam alterados após a criação, isso permitirá que os dados, uma vez criados, não são alterados. Em vez disso, novas versões dos dados são geradas quando necessário, o que ajuda a prevenir erros comuns relacionados a alterações inesperadas de estado;<br/>&#9• <b>Funções puras:</b> Escrever funções puras e combiná-las facilita a criação de aplicações modulares e testáveis no Node.js.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Aqui, temos o exemplo que mostra o paradigma funcional sendo aplicado no Node.js. Aqui, temos a função <code>multiplicarPorDois</code>, que é um exemplo de função pura. Em programação funcional, funções puras são aquelas que, dado um mesmo conjunto de entradas, sempre retornam o mesmo resultado, sem modificar estados externos ou causar efeitos colaterais. Essa função recebe um número como argumento e retorna esse número multiplicado por dois.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Logo abaixo, temos a função <code>aplicarOperacao</code>, que exemplifica o conceito de função de alta ordem. Em programação funcional, uma função de alta ordem é aquela que recebe outra função como argumento ou retorna uma função. No nosso caso, <code>aplicarOperacao</code> recebe um array e uma função, aplicando essa função a cada elemento do array utilizando o método <code>map()</code>. O método <code>map()</code> é uma característica importante da programação funcional, pois permite transformar coleções de dados sem modificar a original, garantindo imutabilidade.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Na linha 10, criamos um array de números [1, 2, 3, 4, 5]. Em seguida, chamamos <code>aplicarOperacao</code>, passando esse array e a função <code>multiplicarPorDois</code> como parâmetros. O resultado é um novo array onde cada número foi multiplicado por dois, sem alterar o array original. Esse conceito de imutabilidade é fundamental na programação funcional, pois evita efeitos colaterais e facilita a manutenção do código.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Por fim, exibimos o resultado no console, que nos retorna [2, 4, 6, 8, 10]. Esse exemplo mostra como o paradigma funcional pode ser aplicado no Node.js para escrever código modular, previsível e mais fácil de testar.",
                                "pathImgInferior": "/assets/Exemplo/exemplo paradigma funcional.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<ol start='5'>&#9<li><b>Programação Declarativa:</b> A programação declarativa é um paradigma que se concentra em descrever o que deve ser feito, sem especificar detalhadamente como realizar as operações. Diferentemente da programação imperativa, que define uma sequência explícita de comandos, a abordagem declarativa permite que o desenvolvedor especifique o resultado desejado, delegando ao sistema a responsabilidade de determinar o fluxo de execução necessário para alcançá-lo.</li></ol>",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<b>Características:</b><br/>Principais Características da Programação Declarativa no Node.js:<br/>&#9• <b>Abstração de Controle:</b> O programador define o objetivo final, e o sistema gerencia os detalhes de implementação para atingir esse resultado;<br/>&#9• <b>Imutabilidade e Ausência de Estado:</b> As operações não dependem de estados internos ou variáveis mutáveis, promovendo previsibilidade e facilitando a depuração;<br/>&#9• <b>Transparência Referencial: :</b> Funções ou expressões produzem o mesmo resultado quando dadas as mesmas entradas, sem efeitos colaterais, permitindo substituições seguras e otimizando o código;<br/>&#9• <b>Concisão e Clareza:</b> A sintaxe tende a ser mais enxuta e expressiva, focando no &quot;o quê&quot; em vez do &quot;como&quot;, o que melhora a legibilidade e manutenção do código.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "No contexto do Node.js, a programação declarativa é frequentemente aplicada por meio de técnicas funcionais e uso de APIs que permitem descrever operações de forma declarativa.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Abaixo temos um exemplo dessa vez sobre o paradigma declarativo sendo aplicado no Node.js. Diferente da programação imperativa, onde descrevemos passo a passo como o programa deve executar cada ação, na programação declarativa focamos no que queremos alcançar, deixando que a linguagem e suas funções abstratas lidem com os detalhes da execução. No exemplo abaixo, temos um array de números e utilizamos funções declarativas como <code>filter()</code>, <code>map()</code> e <code>reduce()</code> para manipular os dados de forma clara e expressiva, sem precisar de laços ou variáveis auxiliares.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Primeiramente, criamos um array de números de 1 a 10. Em seguida, definimos a função <code>ehPar</code>, que verifica se um número é par, e a função <code>aoQuadrado</code>, que eleva um número ao quadrado. Ambas são funções puras, pois sempre retornam o mesmo resultado para os mesmos argumentos, sem causar efeitos colaterais.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Na linha 10, aplicamos a cadeia de métodos declarativos: primeiro usamos <code>filter(ehPar)</code>, que retorna apenas os números pares do array; depois <code>map(aoQuadrado)</code>, que transforma cada número par em seu quadrado; e por fim <code>reduce((acc, val) => acc + val, 0)</code>, que soma todos os valores resultantes. Esse encadeamento de funções evita a necessidade de estruturas imperativas, como <code>for</code> ou <code>while</code>, tornando o código mais legível e conciso.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Ao final, o código nos retorna 220, que é a soma dos quadrados dos números pares do array original. Esse exemplo mostra como a programação declarativa torna o código mais expressivo e fácil de entender, permitindo que o desenvolvedor foque no resultado desejado, sem se preocupar com os detalhes de implementação.",
                                "pathImgInferior": "/assets/Exemplo/exemplo paradigma declarativo.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<ol start='6'>&#9<li><b>Programação Orientada a Eventos:</b> A Programação Orientada a Eventos é um paradigma no qual o fluxo de execução de um programa é determinado por eventos, como interações do usuário, mensagens de outros sistemas ou mudanças de estado. No Node.js, esse paradigma é fundamental, permitindo a construção de aplicações assíncronas e altamente responsivas.</li></ol>",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<b>Características:</b><br/>Principais Características da Programação Orientada a Eventos no Node.js:<br/>&#9• <b>Assincronicidade:</b> As operações são executadas de forma não bloqueante, permitindo que o programa continue processando outras tarefas enquanto aguarda a conclusão de operações anteriores;<br/>&#9• <b>Emissão e Escuta de Eventos:</b> Componentes do sistema podem emitir eventos, enquanto outros &quot;ouvintes&quot; reagem a esses eventos, facilitando a comunicação entre diferentes partes da aplicação;<br/>&#9• <b>Loop de Eventos (Event Loop):</b> Mecanismo central do Node.js que gerencia a execução de operações assíncronas, despachando eventos e garantindo que as funções de callback correspondentes sejam executadas no momento apropriado.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Abaixo, temos um exemplo que demonstra a aplicação da Programação Orientada a Eventos no Node.js. Utilizamos o módulo events para criar um emissor de eventos personalizado que reage a um evento específico.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Primeiro, vamos realizar a importação do módulo <code>events</code>: Utilizamos o módulo interno do Node.js chamado <code>events</code>, que fornece a classe <code>EventEmitter</code> para a criação e manipulação de eventos. Depois temos a criação de uma classe personalizada <code>MeuEmissor</code>, que estende <code>EventEmitter</code>, permitindo que instâncias dessa classe emitam e escutem eventos personalizados, e, em seguida temos a instanciação do Emissor de Eventos, aqui estamos criando uma instância de <code>MeuEmissor</code> chamada <code>meuEmissor</code>, que será utilizada para emitir e ouvir eventos, depois, realizamos o registro de um Ouvinte de Evento, utilizamos o método <code>on</code> para registrar uma função que será executada sempre que o evento '<code>eventoPersonalizado</code>' for emitido. Nesse caso, a função simplesmente imprime uma mensagem no console, por fim temos a emissão do evento personalizado: Chamamos o método <code>emit</code> para disparar o evento '<code>eventoPersonalizado</code>', acionando todos os ouvintes registrados para esse evento. Como resultado, a mensagem definida anteriormente é exibida no console.",
                                "pathImgInferior": "/assets/Exemplo/exemplo paradigma orientada a eventos.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<br/>No geral os paradigmas de programação no Node.js são fundamentais para entender como essa tecnologia se destaca no desenvolvimento de aplicações modernas. Ele adota principalmente os paradigmas assíncrono e orientado a eventos, que permitem um alto desempenho em aplicações de rede e sistemas escaláveis. Além disso, suporta a programação funcional com o uso de funções de ordem superior, promessas e async/await, tornando o código mais modular e reutilizável.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Por outro lado, o paradigma orientado a objetos também pode ser utilizado, principalmente com classes do ES6, facilitando a organização de grandes projetos. No entanto, devido à natureza do JavaScript, a combinação de múltiplos paradigmas dentro do mesmo projeto é comum e pode ser benéfica.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Em conclusão, o Node.js oferece uma abordagem flexível e eficiente para o desenvolvimento de software, permitindo que os desenvolvedores escolham os paradigmas que melhor se adaptam às necessidades do projeto. Seu modelo assíncrono e não bloqueante, aliado à versatilidade da linguagem, faz dele uma escolha poderosa para aplicações escaláveis e de alto desempenho.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Conceitos de IDE, instalação e configuração do VS Code",
                        "descricao": "Aqui você irá descobrir o que é uma IDE, para que serve, como realizar a instalação completa, dicas e configuração da IDE do Visual Studio Code",
                        "pathImgSessao": "/assets/Exemplo/EX1 visual ProjeCLP1.png",
                        "pathVideoSessao": "",
                        "highlightColor": "rgb(113 36 197)",
                        "paragrafos": [
                            {
                                "texto": "Depois das configurações iniciais, vamos entender um pouco mais sobre a IDE Visual Studio Code, que é uma das mais utilizadas por desenvolvedores de todo o mundo. Aprenda a criar, editar e salvar arquivos, além de instalar extensões e personalizar o ambiente de desenvolvimento.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "/assets/Exemplo/EX2 visual ProjeCLP1.png",
                                "pathVideoSuperior": "",
                                "texto": "Na imagem acima temos a tela inicial da IDE, claro depois das configurações pois instalação, aqui veremos como na imagem abaixo de Start/Começar as opções New File/Novo arquivo, Open File/Abri arquivo, Open Folder/Abri Pasta, Clone Git Repository/ Clonar repositorio do Git, Connect to/ Conectar para. As ultimas duas opções vamos aprofundar mais para frente no curso, aqui vamos focar nas primeiras 3 opções. Ao clicar em New File vamos gera a seguinte ação.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "/assets/Exemplo/EX4 visual ProjeCLP1.png",
                                "pathVideoSuperior": "",
                                "texto": "Aqui nos colocaremos o nome do arquivo que vamos gerar e sua respectiva extensão que no Node herda do JavaScript o js. Como no exemplo abaixo vamos criar o arquivo <b>Primeiro Script.js</b>, e logo após clicar em Save/Salvar. Apos isso vamos ver a tela de edição do arquivo.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "/assets/Exemplo/EX5 visual ProjeCLP1.png",
                                "pathVideoSuperior": "",
                                "texto": "E assim começa a diversão! Aqui vamos escrever nosso primeiro código em Node.js, que será um simples console.log(“Hello World!”). Para executar o código, basta clicar no botão Run/Executar, que fica no canto superior direito da tela. Pronto! Você acaba de executar seu primeiro script em Node.js.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "/assets/Exemplo/EX6 visual ProjeCLP1.png",
                                "texto": "Uma segunda forma é ir direto no Terminal/CMD como a imagem acima explicita, é um pouco mais complicado mas não impossível! Assim simplesmente usar o código <b>cd 'diretorio'</b> para link a pasta do arquivo e usa o <b>node 'Primeiro Script.js'</b> e pressiona enter, assim mostra as imagens abaixo.",
                                "pathImgInferior": "/assets/Exemplo/EX7 visual ProjeCLP1.png"
                            },
                            {
                                "pathImgSuperior": "/assets/Exemplo/EX8 visual ProjeCLP1.png",
                                "texto": "Depois de ter começado um projeto pode salvar o arquivo em file depois save e aproveitar para ativar o autosave para a cada mudança não seja perdida! E caso vem ter um acesso futuro no arquivo pode o acessá-lo em Open File da tela inicial e se quiser abri uma pasta inteira dos arquivos do seu projeto pode-se usar o Open Folder.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "texto": "O Open Folder é claro a opção mais interessante ao usá-lo pode se visualizar seu projeto na opção abaixo.",
                                "pathImgInferior": "/assets/Exemplo/EX3 visual ProjeCLP1.png"
                            },
                            {
                                "texto": "E visualizar mais o menos assim na imagem abaixo na área de EXPLORER. Na imagem temos em uma tela o exemplo do Primeiro Script e outro de uma expectativa de futuro a ti aluno!",
                                "pathImgInferior": "/assets/Exemplo/EX9 visual ProjeCLP1.png"
                            },
                            {
                                "texto": "E assim terminamos o primeiro modulo, com a execução do primeiro script em Node.js. Parabéns! Você está no caminho certo para se tornar um desenvolvedor backend de sucesso."
                            }
                        ]
                    },
                    {
                        "titulo": "Como começar um projeto Node.js e as configurações iniciais",
                        "descricao": "Aprenda a instalar o Node.js, configurar um projeto do zero e preparar seu ambiente de desenvolvimento.",
                        "pathImgSessao": "/assets/CAPA CURSO.png",
                        "pathVideoSessao": "",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "texto": "<a href='https://nodejs.org' target='_black'>Site de instalação</a> logo no cabeçalho estará a opção descarregar/Download. Logo ao carregar a página ficara disponível as opções que será claramente de sua escolha e vontade! Mas por padrão será baseado pela a configuração de sua maquina. No Linux temos a opção de usar o terminal para a instalação podendo ser até mais segura, executando o simples código sudo apt-get install Node.js. <a href='https://www.youtube.com/watch?v=tpzFsrEJm1A' target='_blank'>assista aqui o tutorial!</a>",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Para ter mais liberdade e praticidade no desenvolvimento do código utilizaremos sempre uma IDE( Integrated Development Environment/ Ambiente de Desenvolvimento Integrado), no universo dos programadores tem diversas opção como Android Studio, NetBeans, Eclipse… Mas aqui vamos usar o Visual Studio Code/VS, o link é nada mas que <a href='https://code.visualstudio.com/' target='_blank'>site de instalação</a> logo na pagina principal estará as opção de download, a instalação ocorre como qualquer outro software, sem maiores dificuldade tanto no windows ou linux. A configuração também é bastante intuitiva de escolha personalizada, sendo assim configure da forma que achar melhor, não tens muitas configuração técnica na página de entrada, somente ensinos e escolha de comportamento da IA e themes.",
                                "pathImgInferior": "/assets/Exemplo/Ex1.png",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Executando o primeiro script",
                        "descricao": "Escreva e execute seu primeiro script no terminal, entendendo os conceitos basicos de JavaScript e Node.js.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://youtu.be/DiNLHjzn818",
                        "highlightColor": "#68EC13",
                        "paragrafos": [
                            {
                                "texto": "Depois de instalado o software do Node, podemos dependendo do sistema operacional utilizar o cmd/terminal para executar alguns comandos. Veja o exemplo do video acima!",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "texto": "Entendendo mais abaixo sobre o JavaScript e Node!"
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Segundo o livro: <b><i>Aprendendo JavaScript / Filipe Del Nero Grillo e Renata Pontin de Mattos Fortes</b></i>. Sumario 2 : A linguagem JavaScript foi criada pela Netscape Communications Corporation e foi desenvolvida com o nome de Mocha, depois passou a se chamar LiveScript e foi finalmente lançada como JavaScript em 1995 integrando a versão 2.0B3 do navegador Netscape e visava implementar uma tecnologia de processamento modo cliente. A denominação da linguagem, JavaScript, se deve a similaridades com a sintaxe do Java e embora as duas linguagens não tenham nenhuma outra relação além desta, os nomes ainda causam confusão para alguns usuários. Mais tarde, a linguagem tornou-se um padrão da ECMA (European Computer Manufacturers Association) que atualmente é seguido por outros desenvolvedores como os da Adobe com a linguagem ActionScript. A implementação da Microsoft do ECMAScript é chamada de JScript ou ActiveScript, popularmente conhecido como ActiveX, usada nos navegadores Internet Explorer. JavaScript permite criar pequenos programas embutidos no próprio código de uma página HTML e capazes de gerar números, processar alguns dados, verificar formulários, alterar valor de elementos HTML e criar elementos HTML. Tudo isso diretamente no computador cliente, evitando a troca de informações com o servidor e o tempo passa a depender somente do processamento local do cliente, não mais da latência da rede.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "texto": "Segundo o livro: <b><i>Aplicações web real-time com Nodejs / Casa do Código/ Caio Ribeiro Pereira</b></i>. Sumario 1.1 O problema das arquiteturas bloqueantes: Os sistemas para web desenvolvidos sobre plataforma .NET, Java, PHP, Ruby ou Python possuem uma característica em comum: eles paralisam um processamento enquanto utilizam um I/O no servidor. Essa paralisação é conhecida como modelo bloqueante (Blocking-Thread). Em um servidor web podemos visualizá-lo de forma ampla e funcional. Vamos considerar que cada processo é requisição feita pelo usuário. Com o decorrer da aplicação, novos usuários vão acessando-a, gerando uma requisição no servidor. . Um sistema bloqueante enfileira cada requisição e depois as processa, uma a uma, não permitindo múltiplos processamentos delas. Enquanto uma requisição é processada as demais ficam em espera, mantendo por um período de tempo uma fila de requisições ociosas. Esta é uma arquitetura clássica, existente em diversos sistemas pelo qual possui um design ineficiente. É gasto grande parte do tempo mantendo uma fila ociosa enquanto é executado um I/O. Tarefas como enviar e-mail, consultar o banco de dados, leitura em disco, são exemplos de tarefas que gastam uma grande fatia desse tempo, bloqueando o sistema inteiro enquanto não são finalizadas. Com o aumento de acessos no sistema, a frequência de gargalos serão mais frequentes, aumentando a necessidade de fazer um upgrade nos hardwares dos servidores. Mas upgrade das máquinas é algo muito custoso, o ideal seria buscar novas tecnologias que façam bom uso do hardware existente, que utilizem ao máximo o poder do processador atual, não o mantendo ocioso quando o mesmo realizar tarefas do tipo bloqueante. 1.2 E assim nasceu o Node.js: Foi baseado neste problema que, no final de 2009, Ryan Dahl com a ajuda inicial de 14 colaboradores criou o Node.js. Esta tecnologia possui um modelo inovador, sua arquitetura é totalmente non-blocking thread (não-bloqueante), apresentando uma boa performance com consumo de memória e utilizando ao máximo e de forma eficiente o poder de processamento dos servidores, principalmente em sistemas que produzem uma alta carga de processamento. Usuários de sistemas Node estão livres de aguardarem por muito tempo o resultado de seus processos, e principalmente não sofrerão de dead-locks no sistema, porque nada bloqueia em sua plataforma e desenvolver sistemas nesse paradigma é simples e prático. 1.3 Single-thread: Suas aplicações serão single-thread, ou seja, cada aplicação terá instância de um único processo. Se você esta acostumado a trabalhar com programação concorrente em plataforma multi-thread, infelizmente não será possível com Node, mas saiba que existem outras maneiras de se criar um sistema concorrente, como por exemplo, utilizando clusters, que é um módulo nativo do Node.js e é super fácil de implementá-lo. Outra maneira é utilizar ao máximo a programação assíncrona."
                            }
                        ]
                    }
                ]
            }
        },
        {
            "titulo": "📦 Gerenciamento de pacotes via NPM",
            "descricao": "Veja como funciona o sistema de gerenciamento de pacotes do Node.js e como realizar instalações, exclusões, atualizações e checagem de versões do pacote, mantendo os pacotes atualizados e seguros.",
            "pathImgModulo": "",
            "categoria": "NPM",
            "duracao": "1h",
            "colors": {
                "main": "#9E1515",
                "background": "#E3B8B8"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "Como funciona o sistema de gerenciamento de pacotes do Node.js?",
                        "descricao": "Entenda o papel do npm, como funcionam os pacotes e sua importância na gestão de dependências.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "NPM é um gerenciador de pacote instalado junto ao próprio Nodejs. É como se fosse a playstore do android que se encontra diversas aplicações a ser utilizadas em seu projeto com fundamento poupar tempo e facilitar a vida do programador. Dentro desse cursos vamos usar algumas como exemplo o Express.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Um dos paradigmas fundamentais que temos que ter em mente sobre o Nodejs é que o mesmo é modularizado, por isso teremos muitos callbacks de entrada e saída e usaremos muito em todos os projetos em vida o require(). O NPM significa Node Package Manager e esse pacotes são módulos, os mais famosos são o Express, Nodemon, Cors, Pm2 dentre outros. Os códigos básicos são <strong>npm install nome_do_pacote</strong>/ para instalar o modulo. <b>npm -g install nome_do_pacote</b>// Para instalar o modulo usando o repositório global. <b>npm install nome_do_pacote --savedev</b>// para instalar o modulo com dependência na maquina assim não ficará só no projeto “é como se fosse executar o modulo com permissão de administrado no PC”. <b>npm remove nome_do_pacote</b>// desinstala o pacote do projeto em questão. Código recomendado a utilizar ao instalar o pacote <b>npm install -g nome_do_pacote --savedev</b>.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Conceito de dependências",
                        "descricao": "Aprenda o que são dependências, a diferença entre dependências de produção e desenvolvimento e como gerenciá-las.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "No desenvolvimento de software com Node.js, o conceito de dependências refere-se a módulos, bibliotecas ou pacotes externos que seu projeto precisa para funcionar corretamente. Essas dependências podem ser bibliotecas de terceiros, frameworks, ferramentas de construção, ou até mesmo outros módulos que você mesmo criou.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Bem , temos diversos tipos de dependência vamos explicar um por um. <b>Dependência Padrão</b> são pacotes essenciais para o funcionamento em produção com já citado express, lodash, axios… todos são listado em arquivo chamado package.json na chave <i>dependencies</i>. <b>Dependência Opcionais</b> são pacotes que se não poderem ser instalados, não deverão impedir a instalação nem o funcionamento do projeto, usa-se esse recurso quando tens pacote especifico que pode  haver de não estar disponíveis em todos os sistemas operacionais, são listada no arquivo package.json na chave <i>optinalDependencies</i>. <b>Dependências de Desenvolvimento</b> são pacotes necessários só durante a produção do projeto, mas não para o projeto em si na sua instalação e funcionamento. Exemplos eslint, jest, typescript… são listada no arquivo package.json na chave <i>devDependencies</i>. <b>Dependências de pares</b> são pacotes que o projeto necessita que o usuário tenha instalado na maquina e não pode ser instalado de forma automática, mas sim manual! Como plugins ou biblioteca exemplo webpack, isso também são listada no arquivo package.json na chave <i>peerDependencies</i>.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Como instalar pacotes do Node.js", 
                        "descricao": "Veja como instalar pacotes globais e locais usando npm ou yarn, além de entender o package.json e o node_modules.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "",
                        "highlightColor": "#68EC13",
                        "paragrafos": [
                            {
                                "texto": "Entra no terminal/cmd: digita <b>npm install nome_do_modulo</b>. O resultado é similar ao da imagem abaixo como quantidade de pacotes feito download, quantidade de pacotes auditado, quantidade de pacotes enxergado e encontrado e quantidade de vulnerabilidades. Na aba explore depois do pacote ser instalado vai surgir uma pasta chamado <b>node_modules</b> e também um aquivo <i>package.json</i> e <i>package-lock.json</i>",
                                "pathImgInferior": "../assets/Exemplo/npm ex1.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Como remover pacotes do Node.js",
                        "descricao": "Aprenda a desinstalar pacotes corretamente, garantindo a limpeza do projeto e a organização das dependências.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "",
                        "highlightColor": "#F28318",
                        "paragrafos": [
                            {
                                "texto": "Para remover pacotes no nodejs usamos o <b>npm remove nome_do_pacote</b>, bem simples e claro!",
                                "pathImgInferior": "../assets/Exemplo/npm remove.png",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Depois da execução do código vai aparecer a quantidade de pacotes removido,auditado e vulneráveis. E a pasta node_modules vai ser limpa e o arquivo package.json vai ser atualizado.",
                                "pathImgInferior": "../assets/Exemplo/npm remove 2.png",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Como atualizar pacotes do Node.js e gerenciamento de versões de pacotes",
                        "descricao": "Descubra como atualizar pacotes, lidar com versões específicas e utilizar o package-lock.json para manter a compatibilidade.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#7515ED",
                        "paragrafos": [
                            {
                                "texto": "Para atualizar os pacotes, podemos começar pela verificação do pacotes, usando <b>npm outdated</b>, para atualizar os pacotes de acordo com as configurações do <i>package.json</i>, caso queira atualizar um projeto especifico pode-se usar <b>npm update nome_do_pacote</b>. Caso queira testa o modulo instalado pode-se usar npx, para verificar se a instalado em sua maquina pode usar <b>which npx</b>, caso não ha pode-se usar <b>npm install -g npx</b>, para atualizar para versões mais recente usa-se <b>npx npm-check-update -u npm install</b>.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    }
                ]
            }
        },
        {
            "titulo": "🧑‍💻 Fundamentos do JavaScript no Node.js",
            "descricao": "Revise os principais conceitos do JavaScript, e, entenda o quais são as diferenças que existem entre CommonJS e ESModules.",
            "pathImgModulo": "",
            "categoria": "Fundamentos",
            "duracao": "1h",
            "colors": {
                "main": "#4B9E15",
                "background": "#D4EEC3"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "Caracteristicas e limitações comuns do JavaScript",
                        "descricao": "Explore as principais características e limitações do JavaScript, como sua natureza assíncrona e o gerenciamento de escopo.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#68EC13",
                        "paragrafos": [
                            {
                                "texto": "As principais do JavaScript no Nodejs são o <i><b>Event Loop</b></i> um modelo non-blocking, permitindo operações concorrentes sem bloquer a thread principal e ideal para aplicações simultâneas de I/O. <i><b>Single-Threaded</b></i>, o Node.js roda em uma única thread, mas usa <i><b>Worked Threads</b></i> para tarefas pesadas em CPU e escalabilidade via cluster mode(múltiplas instâncias do Node). <i><b>CommonJS</i></b> e <i><b>ESM(Módulos)</b></i> é suporte a módulos via <b>require()</b>, <b>Common.JS</b> e <b>import(ES Modules)</b>, dependência gerenciada pelo npm ou yarn. V8 Engine, executar JavaScript com alta performace e suporte a recursos modenos do <i><b>ECMAScript(ES6+)</b></i>. <i><b>Streams</i></b> e <i><b>Buffers</b></i>, otimiza para manipulação de dados em fluxo(streams) e operações com buffers.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "As limitações principais são <i>Single-Threaded</i></b> problemas com <i><b>CPU-Intensive Task</i></b>, código bloqueante com os loops pesados e pode trava o <b>Event Loop</b>, soluções <b>Worker Threads</b>, delegar tarefa a outros serviços. <b>Callback Hell</b>, aninhamento excessivo de callbacks antes de <i><b>promises/async-await</b></i>, solução e usar um async/await ou bibliotecas como Promise.all. Gerenciamento de memória, vazamento de memória podem ocorrer se não forem liberadas referências. Dependência Externas(NPM), o ecossistema tem milhões de pacotes, mas alguns podem ter má qualidade ou vulnerabilidade, problemas com dependency hell(versões conflitante). Falta de suporte a <i><b>Multi-threading</i></b> Nativo, Embora existam <b>Worker Threads</b>, não é tão simples quanto em linguagens como Java ou Go. Processamento de Dados Binários, Embora o Node.js tenha <b>Buffer</b>, manipulação avançada de binários pode ser menos eficiente que em C/C++. Mudanças rápidas na api, algumas api do node.js mudam entre versões, exigindo atualizações frequentes. Segurança, vulnerabilidade em pacotes de terceiros( npm audit é essencial), configurações incorretas podem expor dados sensíveis em produção.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Principais conceitos do JavaScript",
                        "descricao": "Compreenda conceitos chave do JavaScript, como variáveis, funções, objetos, arrays e a manipulação do DOM.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "A linguagem JavaScript é excepcional, pois ao mesmo tempo que é extremamento complexas, a mesmo consegue ser muito intuitiva e fácil de compreender suas nuncias. Aqui vamos ver seus conceitos principais. Os tipos de dados e variáveis temos o <b><i>var</i></b>, <b><i>let</i></b> e <b><i>const</i></b> esses são padrões para declarações. Os primitivos são exempladamente <i><b>string</b></i>, <i><b>number</b></i>, <i><b>boolean</b></i>, <i><b>null</b></i>, <i><b>undefined</b></i>, <i><b>symbol</b></i>, <i><b>bigint</b></i>. Os Objetos são ditos como <i><b>object</b></i> e <i><b>array []</i></b>.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Para operações temos símbolos para indicar a cada sua funções, <b>somar +</b>, <b>subtrair -</b>, <b>multiplicar *</b>, <b>dividir /</b>, obter o restos da <b>divisão %</b>. Para obter o resultado de uma comparação, o mesmo sera em uma resposta boolean como verdadeiro/falso, <b>verificar se é igual o valor (==)</b>, <b>verificar se é igual o valor e tipo (===)</b>, <b>verificar que é diferente o valor (!=)</b>, <b>verifica que é diferente o valor e tipo (!==)</b>, <b>verificar que é maior (>) ou menor (<)</b>.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Os operadores lógicos ajudam muito na formalização da sentença da operação, em javascript temos três. O <b>se e somente se (&&)</b> ex: ((5 + 3 == 8) && (3 + 5 == 8) ) == verdadeiro. <b>O se esse ou esse (||)</b> ex: ((4%2 == 0) || (3%2 == 0)) == verdadeiro, para avaliar a negação de uma sentença só preciso usar o <b>simbolo (!)</b> ex: !(2 + 3 == 6) == verdadeiro.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "As atribuições começa pelo <b>símbolo (=)</b> ex: A = 5 o variável oberar o valor 5 em sua composição. O <b>simbolo (+=)</b> ex: A += 5 o valor 5 somara com o valor que está dentro da variável. O <b>simbolo (-=)</b> ex: A -= 5 o valor subtrairá o valor que está dentro da variável.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Diante as estruturas de controle, são todas as padrões de qualquer linguagem. Temos o <b>if...else = se...senão</b>, <b>switch == coleção de probabilidade</b>. Os loops temos o <b>for == parar em alguma estancia</b>, <b>while == enquanto algo operacional estiver acontecendo</b>, <b>do...while == fazer enquanto algo estiver acontecendo</b>, <b>for...of == é loop que permite iterar sobre elementos</b>, <b>for...in == já é um loop usado parar iterar sobre propriedades enumeráveis de um objetos</b>.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Temos 4 tipos de funções. A declaração <b>function nomeFunção(){}</b>. Expressão <b>const funcao = function(){}</b>. Arrow functions <b>() => {}</b>. E o parâmetros e retorno (<b>return</b>). O retorno é o valor que a função devolve após sua execução, e o parâmetro é o valor que a função recebe como entrada. Exemplo: function soma(a, b) { return a + b; } onde a e b são os parâmetros e o resultado da soma é o retorno da função.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Os principais objetos e protótipos são a coleção de propriedade ({ chave: valor }), herança baseada em protótipos e não em classe tradicionas.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "No javaScript os métodos são diversos. O <b>push()</b> é usado para adicionar um o mais elementos ao final de um array e retornar o novo comprimento do array. O <b>pop()</b> remove o último elemento de um array e retornar esse elemento, modifica o array original e se tiver vazio retorna <i>undefined</i>. O método <b>shift()</b> remove o primeiro elemento de um array e retorna esse elemento. Modificando o array original e deslocando todos os outros elementos para um índice menor. O método <b>unshift()</b> adiciona um ou mais elementos no início de um array e retorna o novo comprimento do array, deslocando os elementos existentes para índices maiores. O método map() é uma função de arrays em javaScript que cria um novo array com os resultados da aplicação de cada elemento do array original. Já o método <b>filter()</b> cria um novo array com todos os elementos que passam em uma implementação fornecida pela função. É extremamente últi para selecionar elementos de array baseado em condições específicas. O método <b>reduce()</b> é umas das operações para manipulação de arrays em JavaScript, executa uma função redutora para cada elemento do array resultando em um único valor de retorno. Já o <b>forEach()</b> é uma função fornecida uma vez para cada elemento de um array, em ordem crescente de índice, sendo muito diferente de map() ou filter(), o forEach não retorna um novo array o fundamento dele é usado para sanar efeitos colaterais.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "No <i><b>âmbito de variável</i></b> de escopo é algo bem simples, temos a global (<b>var</b>) e a de bloco (<b>let e const</b>) que fica retida na (<b>{}</b>) da função em afim.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Já no <i><b>Eventos e Dom(Document Object Model)</b></i>, temos os elementos <b>document.querySelector()</b> aqui pode se buscar uma classe ou Id do método em questão, no <b>getElementById()</b> aqui se busca só o ID. Na manipulação temos o <b>innerHTML</b> para manipular <i><b>TAGS</b></i>. No <b>textContent</b> é um elemento que permite ler ou definir o conteúdo textual de um elemento HTML excluindo tegs e comentários. Em ultimo dos Eventos  Dom temos <b>addEventListener()</b> esse método permite colocar um ouvinte nos eventos ao um elemento HTML especifico, assim ocorrendo um clique, tecla pressionada ou movimentação do mouse, assim adiante.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Já no âmbito <i><b>Assincronismo</b></i> é um conceito que permite a execução de operações demoradas sem bloquear a thread principal, temos em primeiro lugar os <b>Callbacks</b> que é nada mais que funções passadas como argumentos para serem executadas depois. <b>Promises</b> é um objeto que representa a eventual conclusão ou falha de uma operação assíncrona, temos a <i>.then()</i> é um método de Promises usado para lidar com o resultado bem-sucedido de uma operação assíncrona, também permite encadear operações na forma limpa e legível. Outra é o <i>.catch()</i> um método essencial para tratar erros em promises no JavaScript, ele procura e capta falhas no códigos dentro de uma Promise ou .then() anterior no encadeamento. Já em ultimo nas Promises <i>Async/Await</i> é uma forma mais modernar, atual e legível de trabalhar com operações assíncronas em JavaScript, assim permitindo escrever códigos de maneira síncrona, facilitando o entendimento e a manutenção do mesmo. Em ultimo dos Assincronismo temos o <b>Fetch API</b> é a forma mais moderna de fazer requisições HTTP em JavaScript, substituindo o antigo <i>XMLHttpRequest</i>, ela fornece uma interface mais poderosa e flexível para buscar recursos de forma assíncrona, retornando promises nativas.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "O <i><b>tratamento de erros</b></i> no códigos é constituindo pelo <b>try/catch</b> é uma estrutura fundamental em JavaScript para capturar e tratar erros de formar controlada, assim evitando quebras inesperadas que interrompam o fluxo do código. E também é constituindo pelo <b>finally</b> um bloco em uma parte estrutural do try/catch que sempre é executado independente  de ocorrer um erro ou não.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "No JavaScript temos a <i><b>Classes(ES6+)</b></i> que obtém a sintaxe <b>class</b> que é a forma mais clara e orientada ao objeto para criar estruturas reutilizáveis com uma sintaxe limpa e recursos avançados. Temos também o <b>constructor</b> um método em classes que automaticamente quando o objeto é criado o mesmo é executado a partir da classes. Já no conceito de herança temos o <b>extends</b> que permite criar uma classe filha em uma classe pai, herdando seus métodos e propriedade.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Em <i><b>Módulos (ES6)</b></i> temos duas modularizações, o <b>import  e export</b>  é uma forma moderna de compartilhar e organizar arquivos JavaScript, esse sistema do ES6 surgiu para substituir os antigos sistema como CommonJS e AMD",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "O <i><b>Hoisting</b></i> em JavaScript é um comportamento tipico onde a declaração de variáveis e funções são movidas para o topo de seu escopo antes da execução do código.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "O <i><b>Closures</b></i> são um dos conceitos mais poderosos e até importante, eles permitem que a funções “lembrem” e acessem variáveis de seu escopo léxico, mesmo depois  a execução da função externa ter sido finalizada.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "O <i><b>Destructuring</b></i> é uma sintaxe no ES6 que extrair valores de arrays ou objetos de forma mais legível.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "O <i><b>Spread/Rest Operator</b></i> é nada menos que <b>(...)</b> serve para espalhar ou agrupar elementos. O <b>Spread</b> é usado para expandir elementos de um array ou objeto, enquanto o <b>Rest</b> é usado para agrupar múltiplos argumentos em um único array.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Agora o <i><b>Template Literals</b></i> o template strings é somente uma área de adicionamento de expressão variável, representado dessa forma <b>(${})</b>. São uma sintaxe introduzida no ES6 que cria de forma flexível e poderosa, pode ser usando <b>(``)</b> também.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "E também temos o <i><b>JSON(JavaScript Object Notation)</b></i> composto de <b>JSON.parse()</b> e junto com <b>JSON.stringify()</b>. O método <i>JSON.parse()</i> é usado para converter uma string JSON válida em um objeto JavaScript. Já o método <i>JSON.stringify()</i> converter um objeto JavaScript em uma string JSON, criando assim uma lista seriada de dados para compartilhamento e armazenamento.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "No <i><b>Web APIs</b></i> fornece interfaces pelos navegadores que permite e cria interação com recursos do sistema e funcionalidades avançadas, com capacidades específicas para desenvolvimento web. Os principais são <b>localStorage</b>, <b>sessionStorage</b>, <b>setTimeout</b> e <b>setInterval</b>. No <i>localStorege</i> permite armazenar dados no navegador do usuário, como se fosse um cookies, só que não expiram até ser diretamente removidos, tem maior capacidade até mais de 5MB e não são enviados automaticamente em requisições. Já no <i>sessionStorage</i> e umas da forma de armazenar dados temporariamente para sessão atual da aba  do navegador e quando fecha a aba os dados se apagam automaticamente, e lógico cada aba tem seu próprio sessionStorage. E no <i>setTimeout</i> é uma função para executar uma ação em um tempo exato contabilizado em <b>milissegundos</b>. Em ultimo o <i>setInterval</i> é um pouco diferente do <b>setTimeout</b> esse executa repetidamente em um intervalo de tempo definido.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "Em ultimo tópico <i><b>Strict Mode</b></i> ele é fundamental para tornar o código JavaScript mais seguro, evitando assim más práticas. O código em si é <b>(use strict)</b> o mesmo é rigoroso e evitar erros e deixa limpo o executar do código em si.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "<i><b>Saber JavaScript é fundamental, pois é a linguagem base do Node, sem o conhecimento  é enviável o uso do mesmo. Assim recomendo apender pelo menos o básico de JavaScript puro front-end para começar ter as primeiras experiencias no back-end através do NodeJS.</b></i>.",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Diferenças entre CommonJS e ESModules",
                        "descricao": "Aprenda as diferenças entre os sistemas de módulos CommonJS e ESModules, e como cada um é usado no Node.js.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    }
                ]
            }
        },
        {
            "titulo": "📂 Manipulação de Arquivos e Módulos",
            "descricao": "Explore o sistema de módulos do Node.js, aprenda a criar e importar módulos próprios e manipule arquivos utilizando o módulo fs para leitura e escrita.",
            "pathImgModulo": "",
            "categoria": "Arquivos",
            "duracao": "1h",
            "colors": {
                "main": "#9D5816",
                "background": "#EBD4BE"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "Conceito de Módulos do Node.js",
                        "descricao": "Entenda o conceito de módulos no Node.js e como eles permitem a organização e reutilização de código.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#F28318",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Dependências",
                        "descricao": "Aprenda como gerenciar dependências externas em seu projeto e utilizá-las através de módulos no Node.js.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Criar, exportar e importar módulos próprios",
                        "descricao": "Veja como criar seus próprios módulos, exportar funcionalidades e importá-las em outros arquivos.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Manipulação de arquivos utilizando o módulo fs para leitura e escrita",
                        "descricao": "Aprenda a utilizar o módulo fs do Node.js para ler e escrever arquivos de forma síncrona e assíncrona.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#68EC13",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    }
                ]
            }
        },
        {
            "titulo": "🌐 Criando um Servidor Web com Express.js",
            "descricao": "Desenvolva um servidor web com Express.js, aprenda a definir rotas para diferentes métodos HTTP e utilize middlewares para processar requisições.",
            "pathImgModulo": "",
            "categoria": "Express.js",
            "duracao": "1h",
            "colors": {
                "main": "#49148B",
                "background": "#D2BEEB"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "Introdução ao Express.js",
                        "descricao": "Conheça o Express.js, um framework para Node.js, que facilita a criação de servidores e APIs com recursos poderosos e simplificados.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#7515ED",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Desenvolva um servidor web com Express.js",
                        "descricao": "Aprenda a criar um servidor web básico utilizando o Express.js, configurando rotas e respondendo a requisições HTTP.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Conceitos de definições de rota",
                        "descricao": "Entenda o conceito de rotas no Express.js, como defini-las e manipulá-las para responder a diferentes tipos de requisições.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    }
                ]
            }
        },
        {
            "titulo": "🔧 Trabalhando com Banco de Dados",
            "descricao": "Conecte sua aplicação a bancos de dados MySQL ou Firebase, aprenda a realizar consultas e operações básicas para armazenar e recuperar informações.",
            "pathImgModulo": "",
            "categoria": "Banco de Dados",
            "duracao": "1h",
            "colors": {
                "main": "#14538A",
                "background": "#9DBFDD"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "Conceitos básicos do banco de dados SQL",
                        "descricao": "Aprenda o que é Banco de Dados e alguns dos conceitos fundamentais de bancos de dados relacionais SQL, como tabelas, chaves primárias e SQL queries.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1ABBE8",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Conecte sua aplicação ao banco de dados MySQL",
                        "descricao": "Veja como conectar seu projeto Node.js a um banco de dados MySQL e realizar operações básicas de leitura e escrita.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Conceitos básicos do banco de dados NoSQL",
                        "descricao": "Entenda os princípios dos bancos de dados NoSQL, como a flexibilidade e escalabilidade, e como eles se diferenciam dos SQL.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Primeiros passos com Firebase",
                        "descricao": "Explore o Firebase, sua configuração e como ele pode ser usado para armazenar dados em tempo real no seu projeto.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#68EC13",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Conecte sua aplicação ao banco de dados Firebase",
                        "descricao": "Aprenda a integrar seu aplicativo Node.js com o Firebase para criar e ler dados de forma eficiente.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#F28318",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    }
                ]
            }
        },
        {
            "titulo": "🔄 APIs RESTful com Node.js",
            "descricao": "Estruture uma API RESTful completa com Express.js, implemente um CRUD funcional e aprenda a enviar e receber dados em formato JSON.",
            "pathImgModulo": "",
            "categoria": "APIs",
            "duracao": "1h",
            "colors": {
                "main": "#870F36",
                "background": "#E1B6C4"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "Conceitos de API",
                        "descricao": "Entenda o que são APIs, sua importância e como elas permitem a comunicação entre diferentes sistemas e aplicativos.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#EA1A5E",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "O que são APIs RESTful",
                        "descricao": "Aprenda sobre APIs RESTful, seus princípios e como elas utilizam métodos HTTP para operar em recursos de maneira eficiente.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Estruturação de uma API RESTful com Express.js",
                        "descricao": "Descubra como estruturar uma API RESTful com o Express.js, criando rotas e manipulando requisições e respostas.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "O que é CRUD?",
                        "descricao": "Compreenda o conceito de CRUD (Create, Read, Update, Delete) e sua aplicação em sistemas de gerenciamento de dados.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#68EC13",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Implemente um sistema CRUD funcional com Node.js",
                        "descricao": "Aprenda a implementar um sistema CRUD completo usando Node.js, Express.js e um banco de dados para persistir dados.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#F28318",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "O que é JSON?",
                        "descricao": "Saiba o que é o JSON (JavaScript Object Notation) e como ele é usado para troca de dados entre servidor e cliente.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#7515ED",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Enviar e receber dados em formato JSON",
                        "descricao": "Aprenda como enviar e receber dados em formato JSON em uma API, utilizando o Express.js para facilitar a comunicação.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1A88E8",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    }
                ]
            }
        },
        {
            "titulo": "🎯 Deploy e Boas Práticas",
            "descricao": "Gerencie variáveis de ambiente com dotenv, utilize Git para versionamento do código e publique sua aplicação na internet usando a plataforma Vercel.",
            "pathImgModulo": "",
            "categoria": "Deploy",
            "duracao": "1h",
            "colors": {
                "main": "#133C7A",
                "background": "#D1D5DB"
            },
            "conteudos": {
                "sessoes": [
                    {
                        "titulo": "O que são variáveis de ambiente",
                        "descricao": "Entenda o conceito de variáveis de ambiente, sua importância para a configuração de aplicações e como elas ajudam a manter informações sensíveis fora do código.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1265E2",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Gerenciamento de variáveis de ambiente no Node.js com a biblioteca dotenv",
                        "descricao": "Aprenda a usar a biblioteca dotenv no Node.js para carregar variáveis de ambiente de um arquivo .env, mantendo a segurança e flexibilidade no seu projeto.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#1283F4",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "O que é Git e a importância do versionamento de código",
                        "descricao": "Compreenda o Git, suas funcionalidades e como o versionamento de código ajuda na colaboração e controle de mudanças no seu projeto.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#E71A1A",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Introdução ao GitHub e configuração do GitHub no VS Code",
                        "descricao": "Saiba como usar o GitHub para hospedar repositórios e configurar o Git no VS Code, facilitando o controle de versão e o trabalho em equipe.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#68EC13",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    },
                    {
                        "titulo": "Conceitos de Deployment e como realizar o Deploy de uma aplicação Node.js na plataforma Vercel",
                        "descricao": "Entenda o que é deployment e como realizar o deploy de uma aplicação Node.js utilizando a plataforma Vercel para tornar sua aplicação acessível online.",
                        "pathImgSessao": "https://global.discourse-cdn.com/freecodecamp/optimized/4X/b/2/b/b2b29cf1ff8514236fa0ade16aa677e5539a14e8_2_1024x529.png",
                        "pathVideoSessao": "https://www.youtube.com/watch?v=vYekSMBCCiM",
                        "highlightColor": "#F28318",
                        "paragrafos": [
                            {
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            },
                            {
                                "pathImgSuperior": "",
                                "pathVideoSuperior": "",
                                "texto": "",
                                "pathImgInferior": "",
                                "pathVideoInferior": ""
                            }
                        ]
                    }
                ]
            }
        }
    ]
}